[{"title":"Appeal to the stone","category":"informal","text":"Appeal to the stone is a logical fallacy that consists in dismissing a statement as absurd without giving proof of its absurdity.","example":"Speaker A: Infectious diseases are caused by microbes.<br/>Speaker B: What a ridiculous idea!<br/>Speaker A: How so?<br/>Speaker B: It's obviously ridiculous.<br/><br/>Speaker B gives no evidence or reasoning, and when pressed, claims that Speaker A's statement is inherently absurd, thus applying the fallacy..","link":"https://fallacy.in/appeal-to-the-stone.html"},{"title":"Conjunction fallacy","category":"formal","text":"The conjunction fallacy is a formal fallacy that occurs when it is assumed that specific conditions are more probable than a single general one.","example":"Linda is 31 years old, single, outspoken, and very bright. She majored in philosophy. As a student, she was deeply concerned with issues of discrimination and social justice, and also participated in anti-nuclear demonstrations.<br/><br/> Which is more probable?<br/> Linda is a bank teller.<br/>Linda is a bank teller and is active in the feminist movement.<br/><br/>The majority of those asked chose option 2. However, the probability of two events occurring together (in conjunction) is always less than or equal to the probability of either one occurring alone","link":"https://fallacy.in/conjunction-fallacy.html"},{"title":"Base rate fallacy","category":"formal","text":"Base rate fallacy, also called base rate neglect or base rate bias, is a formal fallacy. If presented with related base rate information (i.e. generic, general information) and specific information (information only pertaining to a certain case), the mind tends to ignore the former and focus on the latter.","example":"If you overlook the base-rate information that 90% and then 10% of a population consist of lawyers and engineers, respectively, you would form the base-rate fallacy that someone who enjoys physics in school would probably be categorized as an engineer rather than a lawyer.","link":"https://fallacy.in/base-rate-fallacy.html"},{"title":"Argument from fallacy","category":"formal","text":"Argument from fallacy is the formal fallacy of analyzing an argument and inferring that, since it contains a fallacy, its conclusion must be false.","example":"Tom: All cats are animals. Ginger is an animal. Therefore, Ginger is a cat.<br/>Bill: You have just fallaciously affirmed the consequent. You are incorrect. Therefore, Ginger is not a cat.<br/><br/>Ginger may or may not be a cat. The fact that argument was fallacious is not, in itself, sufficient proof that his conclusion is false.","link":"https://fallacy.in/argument-from-fallacy.html"},{"title":"Appeal to probability","category":"formal","text":"An appeal to probability (or appeal to possibility) is the logical fallacy of taking something for granted because it would probably be the case (or might possibly be the case)","example":"Something can go wrong (premise). <br/>Therefore, something will go wrong (invalid conclusion).","link":"https://fallacy.in/appeal-to-probability.html"}]
