[{"title":"Affirmative conclusion from a negative premise","category":"formal","text":"Affirmative conclusion from a negative premise (illicit negative) is a formal fallacy that is committed when a categorical syllogism has a positive conclusion, but one or two negative premises.","example":"No fish are dogs, and no dogs can fly, therefore all fish can fly.<br/><br/>The only thing that can be properly inferred from these premises is that some things that are not fish cannot fly, provided that dogs exist.<br/><br/>Or:<br/><br/>We don't read that trash. People who read that trash don't appreciate real literature. Therefore, we appreciate real literature.","link":"https://fallacy.in/affirmative-conclusion-from-a-negative-premise.html"},{"title":"Appeal to the stone","category":"informal","text":"Appeal to the stone is a logical fallacy that consists in dismissing a statement as absurd without giving proof of its absurdity.","example":"Speaker A: Infectious diseases are caused by microbes.<br/>Speaker B: What a ridiculous idea!<br/>Speaker A: How so?<br/>Speaker B: It's obviously ridiculous.<br/><br/>Speaker B gives no evidence or reasoning, and when pressed, claims that Speaker A's statement is inherently absurd, thus applying the fallacy..","link":"https://fallacy.in/appeal-to-the-stone.html"},{"title":"Negative conclusion from affirmative premises","category":"formal","text":"Negative conclusion from affirmative premises is a syllogistic fallacy committed when a categorical syllogism has a negative conclusion yet both premises are affirmative. The inability of affirmative premises to reach a negative conclusion is usually cited as one of the basic rules of constructing a valid categorical syllogism.","example":"Premise: All colonels are officers.<br/>Premise: All officers are soldiers.<br/>Conclusion: Therefore, no colonels are soldiers.","link":"https://fallacy.in/negative-conclusion-from-affirmative-premises.html"},{"title":"Masked-man fallacy","category":"formal","text":"The masked-man fallacy (also known as the intensional fallacy and the epistemic fallacy) is committed when one makes an illicit use of Leibniz's law in an argument. Leibniz's law states that, if one object has a certain property, while another object does not have the same property, the two objects cannot be identical.","example":"The name of the fallacy comes from the example:<br/><br/>Premise 1: I know who Bob is.<br/>Premise 2: I do not know who the masked man is<br/>Conclusion: Therefore, Bob is not the masked man.<br/><br/>The premises may be true and the conclusion false if Bob is the masked man and the speaker does not know that. Thus the argument is a fallacious one.","link":"https://fallacy.in/masked-man-fallacy.html"},{"title":"Illicit minor","category":"formal","text":"Illicit minor is a formal fallacy committed in a categorical syllogism that is invalid because its minor term is undistributed in the minor premise but distributed in the conclusion.","example":"All cats are felines.<br>All cats are mammals.<br>Therefore, all mammals are felines.<br><br>The minor term here is mammal, which is not distributed in the minor premise 'All cats are mammals,' because this premise is only defining a property of possibly some mammals (i.e., that they're cats.) However, in the conclusion 'All mammals are felines,' mammal is distributed (it is talking about all mammals being felines). It is shown to be false by any mammal that is not a feline; for example, a dog.","link":"https://fallacy.in/illicit-minor.html"},{"title":"Illicit major","category":"formal","text":"Illicit major is a formal fallacy committed in a categorical syllogism that is invalid because its major term is undistributed in the major premise but distributed in the conclusion.","example":"All dogs are mammals<br>No cats are dogs<br>Therefore, no cats are mammals<br><br>In this argument, the major term is 'mammals'. This is distributed in the conclusion (the last statement) because we are making a claim about a property of all mammals: that they are not cats. However, it is not distributed in the major premise (the first statement) where we are only talking about a property of some mammals: Only some mammals are dogs.<br><br>The error is in assuming that the converse of the first statement (that all mammals are dogs) is also true.","link":"https://fallacy.in/illicit-major.html"},{"title":"Fallacy of the undistributed middle","category":"formal","text":"The fallacy of the undistributed middle (Lat. non distributio medii) is a formal fallacy that is committed when the middle term in a categorical syllogism is not distributed in either the minor premise or the major premise.","example":"All students carry backpacks.<br/>My grandfather carries a backpack.<br/>Therefore, my grandfather is a student.","link":"https://fallacy.in/fallacy-of-the-undistributed-middle.html"},{"title":"Fallacy of four terms","category":"formal","text":"The fallacy of four terms (Latin: quaternio terminorum) is the formal fallacy that occurs when a syllogism has four (or more) terms rather than the requisite three. This form of argument is thus invalid.","example":"Categorical syllogisms always have three terms:<br/><br/>Major premise: All fish have fins.<br/>Minor premise: All goldfish are fish.<br/>Conclusion: All goldfish have fins.<br/><br/>Here, the three terms are: 'goldfish', 'fish', and 'fins'.<br/><br/>Using four terms invalidates the syllogism:<br/><br/>Major premise: All fish have fins.<br/>Minor premise: All goldfish are fish.<br/>Conclusion: All humans have fins.<br/><br/>The premises do not connect 'humans' with 'fins', so the reasoning is invalid. Notice that there are four terms: 'fish', 'fins', 'goldfish' and 'humans'. Two premises are not enough to connect four different terms, since in order to establish connection, there must be one term common to both premises.","link":"https://fallacy.in/fallacy-of-four-terms.html"},{"title":"Fallacy of exclusive premises","category":"formal","text":"The fallacy of exclusive premises is a syllogistic formal fallacy committed in a categorical syllogism that is invalid because both of its premises are negative.","example":"E Proposition: No planets are dogs.<br/>O Proposition: Some dogs are not pets.<br/>O Proposition: Therefore, some pets are not planets.<br/><br/>Explanation of Example 2:<br/><br/>In this example we can more clearly see that the physical difference between a dog and a planet has no correlation to the domestication of dogs. The two premises are exclusive and the subsequent conclusion is nonsense, as the transpose would imply that some pets are planets.<br/><br/>Conclusion:<br/><br/>The verisimilitude of the final statement is not relevant in this fallacy. The conclusions in both examples are uncontroversial; however, both are argued on fallacious logic and would not hold up as valid arguments.","link":"https://fallacy.in/fallacy-of-exclusive-premises.html"},{"title":"Existential fallacy","category":"formal","text":"The existential fallacy, or existential instantiation, is a formal fallacy, where we presuppose that a class has members when we are not supposed to do so; that is, when we should not assume existential import.","example":"Every unicorn definitely has a horn on its forehead. <br/><br/>It does not imply that there are any unicorns at all in the world, and thus it cannot be assumed that, if the statement is true, somewhere there is a unicorn in the world (with a horn on its forehead). The statement, if assumed true, only implies that if there were any unicorns, each would definitely have a horn on its forehead.","link":"https://fallacy.in/existential-fallacy.html"},{"title":"Denying the antecedent","category":"formal","text":"Denying the antecedent, sometimes also called inverse error or fallacy of the inverse, is a formal fallacy of inferring the inverse from the original statement.","example":"One way to demonstrate the invalidity of this argument form is with a counterexample with true premises but an obviously false conclusion. For example:<br/><br/>If you are a ski instructor, then you have a job.<br/>You are not a ski instructor.<br/>Therefore, you have no job.<br/><br/>That argument is intentionally bad, but arguments of the same form can sometimes seem superficially convincing.","link":"https://fallacy.in/denying-the-antecedent.html"},{"title":"Conjunction fallacy","category":"formal","text":"The conjunction fallacy is a formal fallacy that occurs when it is assumed that specific conditions are more probable than a single general one.","example":"Linda is 31 years old, single, outspoken, and very bright. She majored in philosophy. As a student, she was deeply concerned with issues of discrimination and social justice, and also participated in anti-nuclear demonstrations.<br/><br/> Which is more probable?<br/> Linda is a bank teller.<br/>Linda is a bank teller and is active in the feminist movement.<br/><br/>The majority of those asked chose option 2. However, the probability of two events occurring together (in conjunction) is always less than or equal to the probability of either one occurring alone","link":"https://fallacy.in/conjunction-fallacy.html"},{"title":"Base rate fallacy","category":"formal","text":"Base rate fallacy, also called base rate neglect or base rate bias, is a formal fallacy. If presented with related base rate information (i.e. generic, general information) and specific information (information only pertaining to a certain case), the mind tends to ignore the former and focus on the latter.","example":"If you overlook the base-rate information that 90% and then 10% of a population consist of lawyers and engineers, respectively, you would form the base-rate fallacy that someone who enjoys physics in school would probably be categorized as an engineer rather than a lawyer.","link":"https://fallacy.in/base-rate-fallacy.html"},{"title":"Argument from fallacy","category":"formal","text":"Argument from fallacy is the formal fallacy of analyzing an argument and inferring that, since it contains a fallacy, its conclusion must be false.","example":"Tom: All cats are animals. Ginger is an animal. Therefore, Ginger is a cat.<br/>Bill: You have just fallaciously affirmed the consequent. You are incorrect. Therefore, Ginger is not a cat.<br/><br/>Ginger may or may not be a cat. The fact that argument was fallacious is not, in itself, sufficient proof that his conclusion is false.","link":"https://fallacy.in/argument-from-fallacy.html"},{"title":"Appeal to probability","category":"formal","text":"An appeal to probability (or appeal to possibility) is the logical fallacy of taking something for granted because it would probably be the case (or might possibly be the case)","example":"Something can go wrong (premise). <br/>Therefore, something will go wrong (invalid conclusion).","link":"https://fallacy.in/appeal-to-probability.html"},{"title":"Affirming the consequent","category":"formal","text":"Affirming the consequent, sometimes called converse error, fallacy of the converse or confusion of necessity and sufficiency, is a formal fallacy of inferring the converse from the original statement.","example":"If someone owns Fort Knox, then he is rich.<br/>Bill Gates is rich.<br/>Therefore, Bill Gates owns Fort Knox.<br/><br/>Owning Fort Knox is not the only way to be rich. Any number of other ways exist to be rich.<br/>","link":"https://fallacy.in/affirming-the-consequent.html"},{"title":"Affirming a disjunct","category":"formal","text":"Affirming a disjunct fallacy lies in concluding that one disjunct must be false because the other disjunct is true; in fact they may both be true because OR is defined inclusively rather than exclusively. It is a fallacy of equivocation between the operations OR and XOR. Affirming the disjunct should not be confused with the valid argument known as the disjunctive syllogism.","example":"The following argument indicates the unsoundness of affirming a disjunct:<br/><br/>Max is a mammal or Max is a cat.<br/>Max is a mammal.<br/>Therefore, Max is not a cat.<br/><br/>This inference is unsound because all cats, by definition, are mammals.","link":"https://fallacy.in/affirming-a-disjunct.html"},{"title":"Argument from ignorance","category":"informal","text":"Argument from ignorance (from Latin: argumentum ad ignorantiam), also known as appeal to ignorance (in which ignorance represents 'a lack of contrary evidence'), is a fallacy in informal logic. It asserts that a proposition is true because it has not yet been proven false (or vice versa).","example":"Speaker A: Infectious diseases are caused by microbes.<br/>Speaker B: What a ridiculous idea!<br/>Speaker A: How so?<br/>Speaker B: It's obviously ridiculous.<br/><br/>Speaker B gives no evidence or reasoning, and when pressed, claims that Speaker A's statement is inherently absurd, thus applying the fallacy..","link":"https://fallacy.in/argument-from-ignorance.html"}]
